# Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета. Цените зависят от
# сезона:
# Сезон	            Хризантеми	        Рози	        Лалета
# Пролет / Лято	    2.00 лв./бр.	    4.10 лв./бр.	2.50 лв./бр.
# Есен / Зима	    3.75 лв./бр.	    4.50 лв./бр.	4.15 лв./бр.
# В празнични дни цените на всички цветя се увеличават с 15%. Предлагат се следните отстъпки:
# •	За закупени повече от 7 лалета през пролетта – 5% от цената на целият букет.
# •	За закупени 10 или повече рози през зимата – 10% от цената на целият букет.
# •	За закупени повече от 20 цветя общо през всички сезони – 20% от цената на целият букет.
# Отстъпките се правят по така написания ред и могат да се наслагват!
# Всички отстъпки важат след оскъпяването за празничен ден!
# Цената за аранжиране на букета винаги е 2лв. Напишете програма, която изчислява цената за един букет.
# Входът се чете от конзолата и съдържа точно 5 реда:
# •	На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
# •	На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
# •	На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
# •	На четвъртия ред е посочен сезона – [Spring, Summer, Autumn, Winter]
# •	На петия ред е посочено дали денят е празник – [Y – да / N - не]
# Изход
# Да се отпечата на конзолата 1 число –
# цената на цветята, форматирана до вторият знак след десетичната запетая.
num_hriz = int(input())
num_rose = int(input())
num_lale = int(input())
season = input()
day = input()
price = 0
if season == 'Spring' or season == 'Summer':
    price = num_hriz * 2 + num_rose * 4.10 + num_lale * 2.50
elif season == 'Autumn' or season == 'Winter':
    price = num_hriz * 3.75 + num_rose * 4.50 + num_lale * 4.15
if day == 'Y':
    price *= 1.15
if num_lale > 7 and season == 'Spring':
    price *= 0.95
elif num_rose >= 10 and season == 'Winter':
    price *= 0.90
if num_hriz + num_rose + num_lale > 20:
    price *= 0.80
price += 2

print(f'{price:.2f}')



