# Напишете програма която пресмята колко пари ще изкара шофьор на ТИР за един сезон.
# На входа програмата получава през кой сезон ще работи шофьора,
# както и колко километра на месец ще кара. Един сезон е 4 месеца.
# Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:
# 	                                Пролет/Есен	      Лято	           Зима
# км на месец <= 5000	            0.75 лв./км	      0.90 лв./км	   1.05 лв./км
# 5000 < км на месец <= 10000	    0.95 лв./км	      1.10 лв./км	   1.25 лв./км
# 10000 < км на месец <= 20000	    1.45 лв./км – за който и да е сезон
# След като са извадени 10% за данъци се отпечатват останалите пари.
# Вход
# Входът се чете от конзолата и се състои от два реда:
# •	Първи ред – Сезон – текст "Spring", "Summer", "Autumn" или "Winter"
# •	Втори ред –  Километри на месец – реално число в интервала [10.00...20000.00]
# Изход
# На конзолата трябва да се отпечатат едно число:
# •	Заплатата на шофьора след данъците, форматирана до втория знак след десетичната запетая.
season = input()
km = float(input())
if km <= 5000:
    if season == 'Spring' or season == 'Autumn':
        income = 0.75 * km
    elif season == 'Summer':
        income = 0.90 * km
    elif season == 'Winter':
        income = 1.05 * km
elif 5000 < km <= 10000:
    if season == 'Spring' or season == 'Autumn':
        income = 0.95 * km
    elif season == 'Summer':
        income = 1.10 * km
    elif season == 'Winter':
        income = 1.25 * km
elif 10000 < km <= 20000:
    income = 1.45 * km
income *= 4
income *= 0.9

print(f'{income:.2f}')