# Напишете програма, която да умножава положителни числа по 2.
# От конзолата се четат поредица от реални числа, всяко на нов ред,
# докато не се въведе отрицателно. След всяко умножено число на нов ред
# да се отпечата "Result: {резултата от умножението}".
# Резултата от умножението да бъде форматиран до втория знак след десетичния разделител.
# При получаване на негативно число, на конзолата
# да се отпечата "Negative number!" и програмата да приключи изпълнение.
# Вход	Изход
# 12
# 43.2144
# 12.3
# 543.23
# -20	Result: 24.00
# Result: 86.43
# Result: 24.60
# Result: 1086.46
# Negative number!
# 23.43
# 12.3245
# 0
# 65.23432
# 23
# 65
# -12	Result: 46.86
# Result: 24.65
# Result: 0.00
# Result: 130.47
# Result: 46.00
# Result: 130.00
# Negative number!
# -123	Negative number!
number = float(input())
while number >= 0:
    number = number * 2
    print(f"Result: {number:.2f}")
    number = float(input())
else:
    print("Negative number!")
