# Студент трябва да пропътува n километра. Той има избор измежду три вида транспорт:
# •	Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
# •	Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
# •	Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
# Напишете програма, която въвежда броя километри n и период от деня (ден или нощ)
# и изчислява цената на най-евтиния транспорт.
# Вход
# От конзолата се четат два реда:
# •	Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
# •	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
# Изход
# Да се отпечата на конзолата най-ниската цена за посочения брой километри,
# форматирана до втория знак след десетичния разделител.
km = int(input())
tariff = input()
if 0 < km < 20:
    if tariff == 'day':
        price = 0.70 + km * 0.79
        print(f'{price:.2f}')
    elif tariff == 'night':
        price = 0.70 + km * 0.90
        print(f'{price:.2f}')

elif 20 <= km < 100:
    price = 0.09 * km
    print(f'{price:.2f}')

elif km >= 100:
    price = 0.06 * km
    print(f'{price:.2f}')
