# Да се напише програма, която чете едно цяло число N, въведено от потребителя,
# и генерира всички възможни "специални" числа от 1111 до 9999. За да бъде “специално” едно число,
# то трябва да отговаря на следното условие:
# •	N да се дели на всяка една от неговите цифри без остатък.
# Пример: при N = 16, 2418 е специално число:
# •	16 / 2 = 8 без остатък
# •	16 / 4 = 4 без остатък
# •	16 / 1 = 16 без остатък
# •	16 / 8 = 2 без остатък
# Вход
# Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
# Изход
# На конзолата трябва да се отпечатат всички “специални” числа, разделени с интервал

# code provided by Nevena Ilieva - SoftUni's Mentor of Python Basics Program

number = int(input())

for n in range(1111, 10_000):
    for digit in str(n):  # 1111 => "1111"
        if digit == "0" or number % int(digit) != 0:
            break
    else:
        print(n, end=" ")