# Петър иска да купи N видеокарти, M процесора и P на брой рам памет.
# Ако броя на видеокартите е по-голям от този на процесорите получава 15% отстъпка от крайната сметка.
# Важат следните цени:
# •	Видеокарта – 250 лв./бр.
# •	Процесор – 35% от цената на закупените видеокарти/бр.
# •	Рам памет – 10% от цената на закупените видеокарти/бр.
# Да се изчисли нужната сума за закупуване на материалите и да се пресметне дали бюджета ще му стигне.
# Входът се състои от четири реда:
# 1.	Бюджетът на Петър - реално число в интервала [1.0…100000.0]
# 2.	Броят видеокарти - цяло число в интервала [1…100]
# 3.	Броят процесори - цяло число в интервала [1…100]
# 4.	Броят рам памет - цяло число в интервала [1…100]
# Изход
# На конзолата се отпечатва 1 ред, който трябва да изглежда по следния начин:
# •	Ако бюджета е достатъчен:
# "You have {остатъчен бюджет} leva left!"
# •	Ако сумата надхвърля бюджета:
# "Not enough money! You need {нужна сума} leva more!"
# Резултатът да се форматира до втория знак след десетичната запетая.
budget = float(input())
grafic_card = int(input())
processors = int(input())
ram = int(input())
price_gc = 250
price_processor = 0.35 * grafic_card * price_gc
price_ram = 0.10 * grafic_card * price_gc

total_cost = grafic_card * price_gc + processors * price_processor + ram * price_ram

if grafic_card > processors:
    total_cost *= 0.85

difference = budget - total_cost

if difference >= 0:
    print("You have " + f'{difference:.2f}' + " leva left!")
else:
    print("Not enough money! You need " + f'{-difference:.2f}' + " leva more!")