# Напишете програма, която да пресмята колко литра боя е нужна за боядисването
# на къщa.
# Като за стените се използва зелена боя, а за покрива – червена.
# Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
# Стените имат следните размери:
# •	Предната и задната стена са квадрати със страна „x“
# o	на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
# •	Страничните стени са правоъгълници със страни „x“ и „y“
# o	и на двете странични стени има по един квадратен прозорец със страна 1.5м
# Покривът има следните размери:
# •	Два правоъгълника със страни „x“ и „y“
# •	Два равностранни триъгълника със страна „x“ и височина „h“
# Трябва да пресметнете площта на всички страни и площта на покрива, за да
# намерите колко литра от всяка боя ще са нужни.
# От конзолата се четат 3 реда:
# 1.	x – височината на къщата – реално число в интервала [2...100]
# 2.	y – дължината на страничната стена – реално число в интервала [2...100]
# 3.	h – височината на триъгълната стена на прокрива – реално число в интервала [2...100]
# Да се отпечатат на конзолата две числа всяко на нов ред:
# •	Литрите зелена боя
# •	Литритe червена боя
# Форматирани до вторият знак след десетичната запетая.
x_heiht_house = float(input())
y_lenght_side_wall = float(input())
h_height_roof = float(input())
green_paint_cost_1l = 3.4
red_paint_cost_1l = 4.3
area_door = 1.2 * 2
area_window = 1.5 * 1.5
pure_area_front_walls = x_heiht_house * x_heiht_house * 2 - area_door
pure_are_side_walls = x_heiht_house * y_lenght_side_wall * 2 - 2 * area_window
total_area_walls = pure_area_front_walls + pure_are_side_walls
green_paint_total = total_area_walls / green_paint_cost_1l

roof_rect = 2 * x_heiht_house * y_lenght_side_wall
roof_tri = 2 * x_heiht_house * h_height_roof / 2
roof_area = roof_rect + roof_tri
red_paint_total = roof_area / red_paint_cost_1l

print(f'{green_paint_total:.2f}')
print(f'{red_paint_total:.2f}')