# Напишете програма, която да пресмята резултата от игра.
# Първо получавате число, което показва колко хода ще продължи играта.
# После за всеки ход на играта ще получавате по едно ново число.
# Според интервала в който попада числото се прибавят точки.
# Ако числото е отрицателно или по-голямо 50, тогава то е невалидно.
# В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:
# •	От 0 до 9  20 % от числото
# •	От 10 до 19  30 % от числото
# •	От 20 до 29  40 % от числото
# •	От 30 до 39  50 точки
# •	От 40 до 50  100 точки
# •	Невалидно число  резултата се дели на 2
# Вход
# Входът се чете от конзолата:
# •	Първи ред - колко хода ще има по време на играта – цяло число в интервала [1...100]
# •	За всеки ход – числата, които се проверяват в кой интервал са –
# цели числа в интервала [-100...100]
# Изход
# Да се отпечата на конзолата 7 реда:
# •	1ви ред: "{Краен резултат}"
# •	2ри ред: "From 0 to 9: {процент в интервала}%"
# •	3ти ред: "From 10 to 19: {процент в интервала}%"
# •	4ти ред: "From 20 to 29: {процент в интервала}%"
# •	5ти ред: "From 30 to 39: {процент в интервала}%"
# •	6ти ред: "From 40 to 50: {процент в интервала}%"
# •	7ми ред: "Invalid numbers: {процент в интервала}%"
# Всички числа трябва да са форматирани до втория знак след запетаята.
entries = int(input())
score = 0
counter_0_9 = 0
counter_10_19 = 0
counter_20_29 = 0
counter_30_39 = 0
counter_40_50 = 0
counter_inv = 0
for i in range(1, entries + 1):
    number = int(input())
    if number < 0:
        counter_inv += 1
        score = score / 2
    elif number > 50:
        counter_inv += 1
        score = score / 2
    elif 0 <= number <= 9:
        counter_0_9 += 1
        score += number * 0.2
    elif 10 <= number <= 19:
        counter_10_19 += 1
        score += number * 0.3
    elif 20 <= number <= 29:
        counter_20_29 += 1
        score += number * 0.4
    elif 30 <= number <= 39:
        counter_30_39 += 1
        score += 50
    elif 40 <= number <= 50:
        counter_40_50 += 1
        score += 100

print(f"{score:.2f}")
print(f"From 0 to 9: {(counter_0_9 / entries * 100):.2f}%")
print(f"From 10 to 19: {(counter_10_19 / entries * 100):.2f}%")
print(f"From 20 to 29: {(counter_20_29 / entries * 100):.2f}%")
print(f"From 30 to 39: {(counter_30_39 / entries * 100):.2f}%")
print(f"From 40 to 50: {(counter_40_50 / entries * 100):.2f}%")
print(f"Invalid numbers: {(counter_inv / entries * 100):.2f}%")