# Хотел предлага 2 вида стаи: студио и апартамент. Напишете програма, която изчислява
# цената за целия престой за студио и апартамент. Цените зависят от месеца на престоя:
#                   Май и октомври	            Юни и септември	                Юли и август
#                   Студио - 50 лв./нощувка	    Студио - 75.20 лв./нощувка	    Студио - 76 лв./нощувка
#                   Апартамент - 65 лв./нощувка	Апартамент - 68.70 лв./нощувка	Апартамент - 77 лв./нощувка
# Предлагат се и следните отстъпки:
# •	За студио, при повече от 7 нощувки през май и октомври : 5% намаление.
# •	За студио, при повече от 14 нощувки през май и октомври : 30% намаление.
# •	За студио, при повече от 14 нощувки през юни и септември: 20% намаление.
# •	За апартамент, при повече от 14 нощувки, без значение от месеца : 10% намаление.
# Входът се чете от конзолата и съдържа точно 2 реда, въведени от потребителя:
# •	На първия ред е месецът - May, June, July, August, September или October;
# •	На втория ред е броят на нощувките - цяло число.
# Да се отпечатат на конзолата 2 реда:
# •	На първия ред: "Apartment: {цена за целият престой} lv."
# •	На втория ред: "Studio: {цена за целият престой} lv."
# Цената за целия престой да е форматирана с точност до два знака след десетичната запетая.
month = input()
nights = int(input())
price_app = 0.0
price_stud = 0.0
if month == 'May' or month == 'October':
    price_app = 65
    price_stud = 50
    if 7 < nights <= 14:
        price_stud = price_stud * 0.95
    elif nights > 14:
        price_stud = price_stud * 0.70
elif month == 'June' or month == 'September':
    price_app = 68.70
    price_stud = 75.20
    if nights > 14:
        price_stud = price_stud * 0.80
elif month == 'July' or month == 'August':
    price_app = 77
    price_stud = 76

price_stud = price_stud * nights
price_app = price_app * nights

if nights > 14:
    price_app = price_app * 0.90

price_stud = f'{price_stud:.2f}'
price_app = f'{price_app:.2f}'

print(f"Apartment: {price_app} lv.")
print(f'Studio: {price_stud} lv.')

