# Напишете програма, която отпечатва числата в диапазона от 1 до 1000, които завършват на 7.
# Насоки
# 1. Едно число завършва на 7, когато резултатът от модулното деление на числото и 10 е равен на 7;
# 2. Направете for цикъл от 1 до 1000 и проверете за всяко число дали завършва на 7.
# Изпълнилите условието числа принтирайте на конзолата
# Можете да използвате и цикъл със стъпка 7:
for num in range(7, 1001, 10):
    print(num)
# for number in range(1, 1001):
#     if number % 10 == 7:
#         print(number)