# Да се напише програма, която чете n-на брой цели числа,
# въведени от потребителя и проверява дали сред тях съществува число,
# което е равно на сумата на всички останали.
# •	Ако има такъв елемент печата "Yes" и на нов ред "Sum = "  + неговата стойност
# •	Ако няма такъв елемент печата "No" и на
# нов ред "Diff = " + разликата между най-големия елемент и сумата на останалите (по абсолютна стойност)
# Насоки
# 1. Създайте две помощни променливи:
# a. "max_num" с много ниска първоначална стойност, в която да пазите най-голямото от прочетените числа;
# b. "sum_numbers" с първоначална стойност 0, в която да пазите сумата от прочетените числа.
# Според мен има грешка в логиката на решението и това ,че ви дава 100 от 100 нищо не означава.
# Никъде в условието на задачата не е казано, че това число, което е равно на сумата на останалите
# трябва непременно да е най-голямото.
# Какво ще се получи например, ако n=3, и се въведе вход :
# 3
# 5
# 6
# -1
# Изходът би трябвало да е:
# Yes
# Sum = 5
# Очевидно  5=6+ (-1) и е решение на задачата, защото е равно на сумата на всички останали.
# При решението, което сте дали изходът ще е:
# No
# Diff = 2
# Според мен правилното решение би изглеждало нещо подобно на това, но задачата става вече от масиви
import sys
max_num = -sys.maxsize
sum_numbers = 0
n = int(input())
for i in range(0, n):
    num = int(input())
    if num > max_num:
        max_num = num
    sum_numbers += num
if max_num == sum_numbers - max_num:
    print('Yes')
    print(f'Sum = {max_num}')
else:
    sum_numbers = sum_numbers - max_num
    print('No')
    print(f'Diff = {abs(max_num - sum_numbers)}')



