# Шеф на компания забелязва че все повече служители прекарват  време в сайтове, които ги разсейват.
# За да предотврати това, той въвежда изненадващи проверки на отворените табове на браузъра на служителите си.
# Според отворения сайт в таба се налагат следните глоби:
# •	"Facebook" -> 150 лв.
# •	"Instagram" -> 100 лв.
# •	"Reddit" -> 50 лв.
# От конзолата се четат два реда:
# •	Брой отворени табове в браузъра n - цяло число в интервала [1...10]
# •	Заплата - число в интервала [500...1500]
# След това n – на брой пъти се чете име на уебсайт – текст
# Изход
# •	Ако по време на проверката заплатата стане по-малка или равна на 0 лева, на конзолата се изписва
#   "You have lost your salary." и програмата приключва.
# •	В противен случай след проверката на конзолата се изписва остатъкът от заплатата
#   (да се изпише като цяло число).
import math
number_tabs = int(input())
salary = float(input())
tab = ''
penalty = 0
diff = 0
for i in range(1, number_tabs + 1):
    tab = input()
    if tab == "Facebook":
        penalty += 150
    elif tab == "Instagram":
        penalty += 100
    elif tab == "Reddit":
        penalty += 50
    if penalty >= salary:
        print("You have lost your salary.")
        break
diff = salary - penalty
diff = math.floor(diff)
if diff > 0:
    print(diff)
